# 📌 Задача 1.31
# Условие
#     Даны два целых числа. Найти:
#     а) их среднее арифметическое;
#     б) их среднее геометрическое.
# - Усложним условие задачи - пользователь может ввести любое количество
#   положительных целых чисел
#
# - Среднее арифметическое двух чисел a и b — это их сумма, делённая на 2
# - Среднее геометрическое двух чисел a и b — это квадратный корень из их 
#   произведения
import math

# Запрашиваем ввод любого количества целых положительных чисел:
numbers = [int(x) for x in input("Введите числа: ").split()]

# Вычисляем среднее арифметическое:
arithmetic_mean = sum(numbers) / len(numbers)

# Вычисляем среднее геометрическое:
geometric_mean = math.prod(numbers) ** (1 / len(numbers))

# Выводим на печать:
print(f"Вы ввели числа: {numbers}")
print(f"\nИх среднее арифметическое: {arithmetic_mean:.2f}")
print(f"Среднее геометрическое: {geometric_mean:.2f}")
