# Задача:
# Реализуйте ту же задачу, но через постусловие (while True + break).
# Условие выхода — n == 0 (после вычитания последней цифры).


n = int(input("Введите натуральное число: "))
original = n
sum_of_digits = 0

while True:
    last_digit = (
        n % 10
    )  # Берём остаток от деления на 10 - это всегда последняя цифра в любом введённом числе
    sum_of_digits += last_digit  # Прибавляем этот остаток (при первом прохождении цикла прибавляем к 0
    n = n // 10  # Делим нацело. Этим действием мы "отбрасываем" последнюю цифру числа
    if n == 0:  # Проверяем условие: если цифр во введённом числе больше не осталось, то
        break  # Прерываем цикл и

# Печатаем результат:
print(f"Сумма цифр числа {original} = {sum_of_digits}")
