# Задача определения наибольшего
# общего делителя (НОД) двух натуральных чисел.

# Идея алгоритма (из книги):
#
# Если число a больше числа b, то нужно из a вычесть b; в противном случае, наоборот,
# нужно из b вычесть a, и повторять эти действия до тех пор, пока a не станет равно b.
# После этого искомый НОД будет равен одному из полученных чисел.

# Запрашиваем ввод чисел у пользователя, сразу же преобразуем их в целое положительное
# на случай если будут введены отрицательные числа:
a = abs(int(input("Задайте первое число 'a': ")))
b = abs(int(input("Задайте первое число 'b': ")))

# В цикле реализовываем идею алгоритма из книги Златопольского:
while a != b:
    if a > b:
        a -= b
    else:
        b -= a

print(f"НОД = {a}")  # после цикла a == b, это и есть НОД
