
# Задача 10.2:
    # Рассчитать значение y, определив и использовав необходимую функцию:
    # а) y = (1 + sin(1)) / 3 + (5 + sin(5)) / 3 + (3 + sin(3)) / 3

# 1. Импорт модуля
import math

# 2. Определяем вспомогательную функцию
def calculate_term(a):
    '''Определяем вспомогательную функцию'''
    res = (a + math.sin(a)) / 3
    return res

# 3. Вызываем функцию для каждого аргумента и суммируем результат:
y = calculate_term(1) + calculate_term(3) + calculate_term(5)

# Выводим полученное значение на экран с округлением до четырёх знаков:
print(f"Значение y: {y:.4f}")

