# Задача определения наибольшего
# общего делителя (НОД) двух натуральных чисел.

# Будем рассуждать так. Если два заданных числа a и b равны меж-
# ду собой, то их НОД равен одному из них; в противном случае НОД
# равен либо минимальному из заданных чисел, либо некоему целому
# числу, которое меньше этого минимального.

# Запрашиваем ввод чисел у пользователя:

a = int(input("Задайте первое число 'a': "))
b = int(input("Задайте первое число 'b': "))

# Объявляем переменную для хранения НОД:
nod = 0

# Из наших рассуждений, исходя из введённых пользователем чисел, переопределяем НОД:
if a == b:
    nod = abs(a)
elif a > b:
    nod = abs(b)
else:
    nod = abs(a)

# В цикле определяем значение НОД методом пошагового перебора чисел (в любом случае, если даже
# числа простые, общий делитель будет найден. Для простых чисел - это 1)
# Хотя, как будет вести себя алгоритм для отрицательных чисел?
# Потому что -17 и -13 наименьшее -17, в цикле будет -17 - 1 = -18. Программа зациклится!
# Поэтому переменную nod необходимо брать по мдулю! (Исправил код выше)
while True:
    # Цикл можно было так построить:
    # while not (a % nod == 0 and b % nod == 0):
    #     nod -= 1
    if a % nod == 0 and b % nod == 0:
        break
    else:
        nod -= 1

print(f"Наибольший общий делитель для чисел {a} и {b} равен {nod}")
