# Задача 1. Прокат автомобилей
#
# Напишите программу, которая спрашивает у пользователя, какую машину он хотел бы взять напрокат. 
# Программа выводит сообщение: Посмотрим, смогу ли я найти вам Subaru. (вместо Subaru — что ввёл пользователь, с заглавной буквы через .title()).
#
# Что тренируется: input() + f-строка

cars = input("Какую машину Вы бы хотели взять на прокат? ")
print(f"Посмотрим, смогу ли я найти Вам {cars.title()}.")


# Задача 2. Бронирование столика
# Напишите программу, которая спрашивает, на сколько человек нужен столик.
#     Если число больше 8 — вывести: На {N} человек, к сожалению, придётся подождать.
#     Если 8 или меньше — вывести: Ваш столик на {N} человек готов!
# Что тренируется: input() + int() + if/else.

question = int(input("\nНа сколько человек Вы хотите заказать столик? "))

if question > 8:
    print(f"На {question} человек, к сожалению, придётся подождать.")
else:
    print(f"Ваш столик на {question} человек готов!")


# Задача 3. Числа, кратные 10
# Напишите программу, которая:
#     Спрашивает у пользователя число.
#     Сообщает, кратно ли оно 10.

examination = True

while examination:
    number = int(input("\nВведите целое число: "))
    
    if number % 10 == 0:
        print(f"Число {number} кратно 10.")
    else:
        print(f"Число {number} не кратно 10.")
        
    # 3. Спрашиваем, нужно ли продолжать
    continue_input = input("Продолжите ввод числа? (Да/Нет): ").title()
    
    # 4. Управляем флагом цикла
    if continue_input != "Да":
        examination = False


# Задача 4. Билеты в кино
# Программа спрашивает у пользователя возраст и сообщает цену билета по правилам:
#     до 3 лет — бесплатно;
#     от 3 до 12 лет — 10 долларов;
#     старше 12 лет — 15 долларов.
# Программа должна работать в цикле, пока пользователь не введёт quit. Для выхода из цикла используй break.


while True:
    age = input("\nВведите возраст (или 'quit' для выхода): ")
    if age.lower() == "quit":
        break
    age = int(age)
    if age < 3:
        print("Билет бесплатный.")
    elif 3 <= age <= 12:
        print("Билет стоит 10 долларов.")
    else:
        print("Билет стоит 15 долларов.")





























