# Задача 1: Классификация акций по цене
#     Есть список цен prices = [150.50, 850.00, 1200.00, 15000.00, 300.00].
#     Для каждой цены определи категорию:
#         < 500 → "Дешёвая"
#         < 1000 → "Средняя"
#         < 5000 → "Дорогая"
#         >= 5000 → "Премиум"
#     Выведи каждую цену с категорией.
# Проверим так же на последнее условие, дляя чего добавим в список цену ровно 5000
prices = [150.50, 850.00, 1200.00, 15000.00, 300.00, 5000.00]
# category = ""  если есть необходимость использовать переменную вне цикла

for price in prices:
    if price < 500:
        category = "Дешёвая"
    elif price < 1000:
        category = "Средняя"
    elif price < 5000:
        category = "Дорогая"
    else:
        category = "Премиум"
    print(f"{price} - {category}")

# Задача 2: Проверка портфеля на пустоту
#     Создай пустой список portfolio = [].
#     Проверь: если пуст — выведи "Портфель пуст. Добавь акции!".
#     Добавь 3 акции.
#     Проверь снова — выведи список акций.

portfolio = ["SBER", "GAZP", "LKOH"]
if portfolio:
    print(f"\nВ портфеле - {len(portfolio)} акций")
else:
    print("\nПортфель пуст. Добавь акции!")

# Задача 3: Проверка нескольких запросов
#     Есть список wanted = ["SBER", "AAPL", "GAZP", "TSLA", "LKOH"].
#     Есть список allowed = ["SBER", "GAZP", "LKOH", "GMKN"].
#     Для каждой акции из wanted:
#         Если в allowed — "Покупаем X".
#         Если нет — "X недоступна".
#     В конце выведи количество купленных акций.

wanted = ["SBER", "AAPL", "GAZP", "TSLA", "LKOH"]
allowed = ["SBER", "GAZP", "LKOH", "GMKN"]
quantity_purchased = 0

print()  # Пустая строка для отделения  от предыдущей задачи
for stock in wanted:
    if stock in allowed:
        print(f"Покупаем {stock}.")
        quantity_purchased += 1
    else:
        print(f"{stock} недоступна.")
print(f"Количество купленных акций - {quantity_purchased}")

# Задача 4: Калькулятор скидки
#     Есть сумма покупки amount.
#     Правила:
#         >= 100_000 → скидка 10%.
#         >= 50_000 → скидка 7%.
#         >= 10_000 → скидка 5%.
#         < 10_000 → скидка 0%.
#     Выведи сумму с учётом скидки.
# пример вывода:
# Сумма: 75_000.00 руб.
# Скидка: 7%
# Итог: 69_750.00 руб.

amount = 100_001

if amount >= 100_000:
    discount = 0.10
elif amount >= 50_000:
    discount = 0.07
elif amount >= 10_000:
    discount = 0.05
final = amount * (1 - discount)

print(f"\nСумма: {amount:_.2f} руб.")
print(f"Скидка: {discount * 100}%")
print(f"Итог: {final:_.2f} руб.")
