my_foods = ["pizza", "falafel", "carrot cake", "pepperoni"]

# 4.10. Срезы. Добавьте фрагмент, который делает следующее:
# • выводит сообщение «Первые три пункта в списке — это:», а затем использует
# срез для вывода первых трех элементов из списка;
# • выводит сообщение «Три пункта из середины списка:», а затем использует
# срез для вывода первых трех элементов из середины списка;
# • выводит сообщение «Последние три пункта в списке — это:», а затем исполь-
# зует срез для вывода последних трех элементов из списка.

print(f"Первые три пункта в списке -  это: {my_foods[:3]}")
print(
    f"Три пункта из середины списка: {my_foods[len(my_foods) // 2 - 1 : len(my_foods) // 2 + 2]}"
)
print(f"Последние три пункта в списке - это: {my_foods[-3:]}")

# 4.11. Моя пицца, твоя пицца. Начните с программы из упражнения 4.1. Соз-
# дайте копию списка с видами пиццы, присвойте ему имя friend_pizzas. Затем
# сделайте следующее:
# • добавьте новую пиццу в исходный список;
# • добавьте другую пиццу в список friend_pizzas;
# • докажите, что в программе существуют два разных списка. Выведите сообще-
# ние «Мои любимые пиццы:», а затем первый список в цикле for. Выведите
# сообщение «Любимые пиццы моего друга:», а затем второй список в цикле for.
# Убедитесь в том, что каждая новая пицца находится в соответствующем списке.

friend_pizzas = my_foods[:]
my_foods.append("cannoli")
friend_pizzas.append("ice cream")

print("Мои любимые пиццы:")
for pizza in my_foods:
    print(pizza)
# То же можно вывести в одну строчку при помощи распаковки генераторного выражения прямо
# внутри print() используя оператор '*' и выбрать разделитель с помощью 'sep='
print("\nМои любимые пиццы: ", end="")
print(*(pizza.capitalize() for pizza in my_foods), sep=", ")

print("\nЛюбимые пиццы моего друга:")
for pizza in friend_pizzas:
    print(pizza)
